[M_SwordInStoner MissionDefinition]
MissionName="Cut the stone with a sword"
MissionDescription=""Powerless Golem" [place]Drain the water.[-place] Stolen dimple's sword. If you can, take the sword from the creature and return it to TRUE.. He will punish you.."
TurnInDescription="If someone pulls a sword out of a stone, he will become a king. Doing so will give you a weapon that kills swords. Your life will be cold."
MissionSummary="Take Roland's sword from Gollum.."
MissionGiver="Roland"
MissionTurnInLocation="Roland"
TeaserText="Grab your sword and launch a powerful attack.."

[M_SwordInStoner:FindGolem MissionObjectiveDefinition]
ProgressMessage="Find the Immortal Golem."

[M_SwordInStoner:GiveSword MissionObjectiveDefinition]
ProgressMessage="Chain sword"

[M_SwordInStoner:GrabSword MissionObjectiveDefinition]
ProgressMessage="Take the sword"

[M_SwordInStoner:ObjSet_AgroGolem MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_SwordInStoner:ObjSet_FindGolem MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_SwordInStoner:ObjSet_GiveSword MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_SwordInStoner:ObjSet_PullSwordOutOfGolem MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_SwordInStoner:PullSwordOutOfGolem MissionObjectiveDefinition]
ProgressMessage="Take a big knife"

